---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.LiningType
source: html/a7062f98-c144-ed87-059b-69455137fb5d.htm
---
# Autodesk.Revit.DB.FabricationPart.LiningType Property

The lining type of the fabrication part.

## Syntax (C#)
```csharp
public string LiningType { get; }
```